import type { TimelineItem } from 'src/types'

export const generalTimeline: TimelineItem[] = [
  {
    isHighlighted: true,
    when: '2016',
    till: 'Зараз',
    title: 'Principal Engineer / Tech Lead',
    description:
      "Найцікавіша для мене роль зараз це щось між Principal Engineer / Tech Lead, де я все ще можу зосередитись на більших задачах, не дуже відволікаючись на менеджерські обов'язки.",
  },
  {
    when: '2014',
    title: 'Lead Developer',
    description:
      'Отримав підвищення працюючи на Luxoft. В основному, працював з JS/CSS, React, Node.js, Electron.',
  },
  {
    when: '2008',
    title: 'Senior Developer',
    description: 'Отримав підвищення працюючи на Tikle. Працював з C#.NET, MSSQL, JS/CSS.',
  },
  {
    isHighlighted: true,
    when: '2009',
    where: 'UA',
    title: 'Вища освіта: спеціаліст/магістр',
    subtitle: 'НТУУ "КПІ", ФПМ, СКС',
    description: [
      'Випускник Національного технічного університету України "Київський політехнічний інститут", факультет Прикладної математики, кафедра Спеціалізованих комп\'ютерних систем.',
      "Я би сказав, досить вдалий вибір у контексті моєї кар'єри: програмування (Pascal, C#, .NET, C++, Assembler), алгоритми і структури даних, графи, теорія імовірностей, бази даних (MSSQL) і ще багато чого.",
      'В 2006 році, будучи студентом, зареєстрував ФОП та отримав першу офіційну роботу як інженер-програміст. На той момент працював з ASP/.NET.',
    ],
  },
  {
    when: '2003',
    where: 'UA',
    title: 'Середня освіта',
    description:
      'Протягом навчання у середній школі закінчив музичку школу (баян та народні інструменти) та весь час відвідував спортивну школу з плавання (кандидат в майстри спорту).',
  },
]
